<img src="http://imgur.com/1ZcRyrc.png" style="float: left; margin: 20px; height: 55px">

# Timeseries and Datetime

_Authors: Samuel Stack (DC)_

---

### Learning Objectives
- Use the datetime library to represent dates as objects
- Calculate time differences with timedelta
- Use datetime objects in pandas on the UFO dataset

### Lesson Guide
- [The `datetime` library](#the-datetime-library)
- [`datetime` object](#datetime-object)
- [`timedelta`](#timedelta)
- [Load the UFO reports data](#load-the-ufo-reports-data)
- [Pandas' `pd.datetime`](#pandas-pddatetime)
	- [The `.dt` attribute](#the-dt-attribute)
- [Time stamps](#time-stamps)
- [Additional resources](#additional-resources)

# What is a *time series*?

**Definition:** A *series* of data points listed at successive points in time.

**Think of examples.**

![](images/dataframe.png)

**Time series are inevitably stored in different formats.**

---

![](images/weather1.png)

---

![](images/weather2.png)

# A Surprisingly (?) Frustrating Aspect of Working with Time

*Working with* **time**!!

- Measurements:
  - Year, month day
  - Day of week
  - Hour, minute, second, microsecond
- Policies:
  - Time zone, daylight savings

# Pythonic Dates

- Standard library
  - `date`
  - *`datetime`*
  - `time`
  - *`timedelta`*

[https://docs.python.org/3.6/library/datetime.html](https://docs.python.org/3.6/library/datetime.html)

<a id="the-datetime-library"></a>
## The `datetime` library
---

The python library `datetime` is great for dealing with time-related data. Pandas being Pandas has incorporated this `datetime` library into its own datetime series and objects.

We're going to review these data types and learn a little more about them.
- Datetime Object
- Datetime Series
- Time Stamp
- Time Delta

<a id="datetime-object"></a>
## `datetime` object
---

Below we can load in the datetime library. Using this we can create a datetime object by entering in the different components of the date as arguments.

In [11]:
# The Date time library is something you should already have because of Anaconda.
from datetime import datetime
lesson_date = datetime(2012,12,21,12, 21,12,840265)
lesson_date

datetime.datetime(2012, 12, 21, 12, 21, 12, 840265)

The components of the date are accessible via attributes of the object.

In [16]:
# A:
print ('Microsecond: ', lesson_date.microsecond)
print ('Day: ', lesson_date.day)
print ('Month: ', lesson_date.month)
print ('Year: ', lesson_date.year)

Microsecond:  840265
Day:  21
Month:  12
Year:  2012

In [24]:
print ('Current Time: ', datetime.now())

Current Time:  2017-11-16 10:23:28.100358

In [25]:
dow = ['M', 'T', 'W', 'R', 'F', 'Sa', 'Su']
print(dow[lesson_date.weekday()])

F

<a id="timedelta"></a>
## `timedelta`
---

Say we want to add time to a date or subtract time.  Maybe we are using time as an index and we want to get everything that happened a week before a specific observation.

We can use a timedelta object to shift (do arithmatic, more or less) a datetime object. Here's an example:

In [31]:
# Import timedelta from datetime library
from datetime import timedelta
offset = timedelta(days=1, seconds =20)

print ('offset days', offset.days)
print ('offset microseconds', offset.microseconds)

offset days 1
offset microseconds 0

The `.now()` function of datetime will give you the datetime object of this very moment.

In [33]:
now = datetime.now()
print (now)

2017-11-16 10:27:42.161730

The current time is particularly useful when using timedeltas.

In [34]:
print ('Future: ', now+offset)
print ('Future: ', now-offset)

Future:  2017-11-17 10:28:02.161730
Future:  2017-11-15 10:27:22.161730

> _Note: The largest value a Time Delta can hold is 'Days'.  I.e. you can't say your want you an offset to be 2 years, 44 days and 12 hours.  You would have to manually convert the time of those years to be represented in days._

You can read more about that here in the timedeltas category.
https://docs.python.org/2/library/datetime.html

<a id="load-the-ufo-reports-data"></a>
## Load the UFO reports data
---

We can practice using datetime functions and objects with the UFO reports data.

In [35]:
# Get a dataset from the internets
import pandas as pd
ufo = pd.read_csv('http://bit.ly/uforeports')

In [36]:
ufo.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

The "Time" column starts off as just an object.

In [37]:
ufo.dtypes

City               object
Colors Reported    object
Shape Reported     object
State              object
Time               object
dtype: object

<a id="pandas-pddatetime"></a>
## Pandas' `pd.datetime`
---

When using pandas we can convert columns of data from string objects into date objects with the `pd.to_datetime` function.

> **Note**: dates can be tricky to parse as they come in many formats. The `to_datetime` function comes with a keyword argument `infer_datetime_format` that can be particularly useful to parse dates.

In [39]:
# A:
ufo['datetime'] = pd.to_datetime(ufo.Time)

In [41]:
ufo.dtypes

City                       object
Colors Reported            object
Shape Reported             object
State                      object
Time                       object
datetime           datetime64[ns]
dtype: object

In [46]:
ufo.head()

,City,Colors Reported,Shape Reported,State,Time,datetime
0,Ithaca,NaN,TRIANGLE,NY,6/1/1930 22:00,1930-06-01 22:00:00
1,Willingboro,NaN,OTHER,NJ,6/30/1930 20:00,1930-06-30 20:00:00
2,Holyoke,NaN,OVAL,CO,2/15/1931 14:00,1931-02-15 14:00:00
3,Abilene,NaN,DISK,KS,6/1/1931 13:00,1931-06-01 13:00:00
4,New York Worlds Fair,NaN,LIGHT,NY,4/18/1933 19:00,1933-04-18 19:00:00

<a id="the-dt-attribute"></a>
### The `.dt` attribute

Pandas datetime columns have a `.dt` attribute that allows you to access attributes specific to the dates. For example:
```python
ufo.Time.dt.day
ufo.Time.dt.month
ufo.Time.dt.year
ufo.Time.dt.weekday_name
```

And many more.

In [45]:
ufo.datetime.dt.weekday_name[0:5]

0     Sunday
1     Monday
2     Sunday
3     Monday
4    Tuesday
Name: datetime, dtype: object

<a id="time-stamps"></a>
## Time stamps
---

Timestamps are useful objects for comparisons. You can create a timestamp object with the `pd.to_datetime` function and a string specifying the date. These timestamps are useful when you need to do logical filtering with dates.

In [47]:
ufo.head()

,City,Colors Reported,Shape Reported,State,Time,datetime
0,Ithaca,NaN,TRIANGLE,NY,6/1/1930 22:00,1930-06-01 22:00:00
1,Willingboro,NaN,OTHER,NJ,6/30/1930 20:00,1930-06-30 20:00:00
2,Holyoke,NaN,OVAL,CO,2/15/1931 14:00,1931-02-15 14:00:00
3,Abilene,NaN,DISK,KS,6/1/1931 13:00,1931-06-01 13:00:00
4,New York Worlds Fair,NaN,LIGHT,NY,4/18/1933 19:00,1933-04-18 19:00:00

In [49]:
ufo.dtypes

City                       object
Colors Reported            object
Shape Reported             object
State                      object
Time                       object
datetime           datetime64[ns]
dtype: object

In [48]:
ts = pd.to_datetime('1/1/1999')
ts

Timestamp('1999-01-01 00:00:00')

In [55]:
ufo.loc[ufo.datetime > ts, : ].head(10)

,City,Colors Reported,Shape Reported,State,Time,datetime
12832,Loma Rica,NaN,LIGHT,CA,1/1/1999 2:30,1999-01-01 02:30:00
12833,Bauxite,NaN,NaN,AR,1/1/1999 3:00,1999-01-01 03:00:00
12834,Florence,NaN,CYLINDER,SC,1/1/1999 14:00,1999-01-01 14:00:00
12835,Lake Henshaw,NaN,CIGAR,CA,1/1/1999 15:00,1999-01-01 15:00:00
12836,Wilmington Island,NaN,LIGHT,GA,1/1/1999 17:15,1999-01-01 17:15:00
12837,DeWitt,NaN,LIGHT,AR,1/1/1999 18:00,1999-01-01 18:00:00
12838,Bainbridge Island,NaN,NaN,WA,1/1/1999 19:12,1999-01-01 19:12:00
12839,Camano Island,NaN,FIREBALL,WA,1/1/1999 19:30,1999-01-01 19:30:00
12840,Cheaha Mountain,NaN,TRIANGLE,AL,1/1/1999 21:00,1999-01-01 21:00:00
12841,Coyoty Canyon,NaN,DISK,NM,1/1/1999 21:00,1999-01-01 21:00:00

<a id="additional-resources"></a>
## Additional resources
---
- search for .dt. on http://pandas.pydata.org/pandas-docs/stable/api.html for more information about pandas Datetime.